#+TITLE:   Work Log/Diary
#+AUTHOR:  Steve Kemp
#+EMAIL:   steve@steve.fi
#+LATEX: \setlength\parindent{0pt}
#+OPTIONS: num:nil html-postamble:nil toc:nil
#+EXPORT_EXCLUDE_TAGS: noexport

* Tag Cloud                                                        :noexport:
The following table is automatically updated every time this document is saved, via the [[skx-saveblock]] handler.

Note that this table is not exported to HTML/PDF, largely because the links wold all be horribly broken.  It might be worth fixing this, to provide the data to readers.

#+NAME: generate-tag-cloud
#+BEGIN_SRC emacs-lisp :colnames '(Frequency Tag) :exports results
(count-tags)
#+END_SRC

#+RESULTS: generate-tag-cloud
| Frequency | Tag        |
|-----------+------------|
|         4 | [[elisp:(org-tags-view nil "noexport")][noexport]]   |
|         2 | [[elisp:(org-tags-view nil "html")][html]]       |
|         1 | [[elisp:(org-tags-view nil "css")][css]]        |
|         1 | [[elisp:(org-tags-view nil "javascript")][javascript]] |
|         1 | [[elisp:(org-tags-view nil "lisp")][lisp]]       |



** CSS                                                            :html:css:

Here we change the way our output document is rendered when exported to HTML:

- We add a fair bit of spacing between daily-entries.
  - New top-level headers use =H2= tags.
- We indent different sub-sections.
  - We setup a margin of =50px;= for each child.
- We insert commas between the tags in our tag-lists.

#+NAME: export-css-to-rendered-output
#+BEGIN_SRC org :noweb yes :exports results :results raw replace
  #+BEGIN_EXPORT html
  <<css-export>>
  #+END_EXPORT
#+END_SRC

#+RESULTS: export-css-to-rendered-output
#+BEGIN_EXPORT html
<style type="text/css">

/* Show the toggle marker is a clickable thing */
.toggle:hover {cursor: pointer;}

/* Indent our child-blocks. */
.outline-2, .outline-text-2, .outline-3, .outline-text-3, .outline-text-4 {
  margin-left: 50px;
}

/* H2 is used for new headlines - separate them vertically */
h2 {
  padding-top: 150px;
}

/* Give headings an underline */
h2 {
 border-bottom: 1px solid grey;
}
h3 {
 border-bottom: 1px dashed grey;
}

/* Separate tags with commas, just to make them look nicer. */
.tag span:not(:last-of-type)::after{
   content: ","
}
</style>
#+END_EXPORT

#+RESULTS:
#+BEGIN_EXPORT html
<style type="text/css">

/* Indent nested children */
.outline-2, .outline-text-2, .outline-3, .outline-text-3, .outline-text-4 {
  margin-left: 50px;
}

/* H2 is used for new headlines - separate them vertically */
h2 {
  padding-top: 150px;
}

/* Give headings an underline */
h2 {
 border-bottom: 1px solid grey;
}
h3 {
 border-bottom: 1px dashed grey;
}

/* Separate tags with commas, just to make them look nicer. */
.tag span:not(:last-of-type)::after{
   content: ","
}
</style>
#+END_EXPORT

#+NAME: display-css-for-humans
#+BEGIN_SRC css :noweb yes
<<css-export>>
#+END_SRC

** Javascript                                              :html:javascript:
The following snippet of javascript is included in our export, and does several things:

- Moves the scroll-position to today's entry, if it can be found.
- Updates each of our headings to prefix the date with the day of the week.
  - Having the weekdays is more pleasant when viewing, but entering them at the time is annoying.
- Makes all source/example/code blocks collapsible.

#+NAME: export-js-to-rendered-output
#+BEGIN_SRC org :noweb yes :exports results :results raw replace
  #+BEGIN_EXPORT html
  <<js-export>>
  #+END_EXPORT
#+END_SRC

#+RESULTS: export-js-to-rendered-output
#+BEGIN_EXPORT html
<script type="text/javascript">

// Format today's date as DD/MM/YYYY
function today() {
    var d = new Date,
        month = '' + (d.getMonth() + 1),
        day = '' + d.getDate(),
        year = d.getFullYear();

    // Pad the day/month name to two-digits.
    if (month.length < 2)
        month = '0' + month;
    if (day.length < 2)
        day = '0' + day;

    return [day, month, year].join('/');
}

// Load jQuery, and setup the init-function to handle the scroll.
(function() {

    // Load jQuery from a CDN
    var script = document.createElement("SCRIPT");
    script.src = 'https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js';
    script.type = 'text/javascript';

    var init = false;

    // init is called once we've loaded jQuery
    script.onload = function() {

        // Get a reference we can use.
        var $ = window.jQuery;

        // Find the offset within the page of today's header,
        // if it can be found.
        var off = $("*:contains('" + today() + "'):last").offset()

        // if we did then scroll to it.
        if ( off ) {
           $(window).scrollTop( off.top );
        }

        // Now iterate over each headline and prefix the day
        // of the week to each date-based headline.

        // Regexp to recognize a date at the start of a headline.
        //
        // NOTE: Not anchored to the end of the line, as some
        // headlines contain following text (e.g. tags).
        var re = new RegExp("^([0-9]+)/([0-9]+)/([0-9]+)(.*)");

        // get all headings.
        $('h2').each(function() {

          // Get the text, and see if it matches our regexp
          var headline = $(this).text();
          var out = headline.match(re);

          if ( out ) {

            // OK it did.
            //
            // However javascript is annoying, so we have to shuffle
            // the date around to allow us to parse.  You'll notice
            // we start with `DD/MM/YYYY`, however for parsing we want
            // to submit `MM/DD/YYYY`.
            //
            var date = out[2] + "/" + out[1] + "/" + out[3];

            // Parse the date, and get the week-day from that
            var d = Date.parse( date );
            var day = new Date(d).getDay();

            var wday =  ['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday'][day];

            // Prepend the weekday to the headline.
            //
            // Note here we use `html` rather than `text` because
            // we don't want to screw up any tags that might be
            // present at the end of the headline.
            //
            // That's the same reason our regular-expression wasn't
            // anchored at the end of the headline too.
            $(this).html( wday + " " + $(this).html() );


           if ( init == false ) {
               // Place something after each PRE tag.
               $("<p style=\"width:100%; text-align:right;\"><a class=\"toggle\">Toggle</a></p>").insertAfter( ".src, .example" );

               //
               // Make the toggle-link work.
               // The HTML-export will look something like this:
               //
               //  <div>
               //   <pre> source block </pre>
               //   <p><a>Toggle</a></p>
               //  </div>
               //
               // When the toggle link is found we can get access
               // to the <PRE> we want to toggle easily as it is
               // a child of the parent-<DIV>.
               $('.toggle').bind('click', function() {
                   $(this).parent().siblings('pre').toggle();
               });
               init = true;
           }
         }
       });
    };
    document.getElementsByTagName("head")[0].appendChild(script);
})();
</script>
#+END_EXPORT

#+RESULTS:
#+BEGIN_EXPORT html
#+END_EXPORT


#+NAME: display-js-for-humans
#+BEGIN_SRC javascript :noweb yes
<<js-export>>
#+END_SRC

